tap "homebrew/cask-fonts"
tap "cjbassi/ytop"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "universal-ctags/universal-ctags"
brew "ack"
brew "openssl@1.1"
brew "ansible"
brew "asciinema"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "black"
brew "libffi"
brew "cairo"
brew "cmake"
brew "cmatrix"
brew "cntlm", restart_service: true
brew "colordiff"
brew "ctags", link: false
brew "docutils"
brew "exa"
brew "fd"
brew "icu4c"
brew "harfbuzz"
brew "webp"
brew "ffmpeg"
brew "fzf"
brew "git-delta"
brew "glances"
brew "gradle"
brew "gts"
brew "pango"
brew "graphviz"
brew "htop"
brew "hyperfine"
brew "ipython"
brew "lazydocker"
brew "lazygit"
brew "libheif"
brew "libmagic"
brew "libssh"
brew "liquidprompt"
brew "ruby"
brew "macvim"
brew "memcached", restart_service: true
brew "mysql-client"
brew "ncdu"
brew "neovim"
brew "nghttp2"
brew "nmap"
brew "openconnect"
brew "postgresql"
brew "postgresql@11"
brew "procs"
brew "pyenv"
brew "ripgrep"
brew "sd"
brew "sl"
brew "tealdeer"
brew "telnet"
brew "tig"
brew "tmux"
brew "tokei"
brew "tree"
brew "unrar"
brew "vim", link: false
brew "watch"
brew "watchman"
brew "wget"
brew "wireshark", link: false
brew "yarn"
brew "ydiff"
brew "youtube-dl", link: false
brew "zlib"
brew "zsh-syntax-highlighting"
brew "cjbassi/ytop/ytop"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "cakebrew"
cask "font-hack-nerd-font"
cask "insomnia"
cask "mactex-no-gui"
cask "powershell"
cask "wireshark"
