tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
brew "ack"
brew "ansible"
brew "asciinema"
brew "bat"
brew "cmatrix"
brew "cntlm", restart_service: true
brew "ctags"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "webp"
brew "glances"
brew "gradle"
brew "graphviz"
brew "htop"
brew "hyperfine"
brew "icu4c"
brew "ipython"
brew "liquidprompt"
brew "memcached", restart_service: true
brew "ncdu"
brew "neovim"
brew "nmap"
brew "node"
brew "openconnect"
brew "postgresql"
brew "pyenv"
brew "shpotify"
brew "sl"
brew "telnet"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "watchman"
brew "wireshark"
brew "yarn"
brew "zlib"
brew "zsh-syntax-highlighting"
brew "jesseduffield/lazydocker/lazydocker"
cask "alacritty"
cask "cakebrew"
cask "powershell"
cask "wireshark"
cask "caskroom/fonts/font-hack-nerd-font"
