tap "homebrew/cask-fonts"
brew "romkatv/powerlevel10k/powerlevel10k"
tap "cjbassi/ytop"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "universal-ctags/universal-ctags"
brew "ack"
brew "openssl@1.1"
brew "ansible"
brew "asciinema"
# brew "awscli"
# brew "bandwhich"  # Network monitoring, not used
brew "bat"
brew "black"
brew "libffi"
brew "cairo"
brew "cmake"
# brew "cmatrix"  # Novelty command, rarely used
# brew "cntlm", restart_service: true
brew "colordiff"
# brew "ctags"
brew "docutils"
brew "exa"
brew "fd"
brew "icu4c"
brew "harfbuzz"
brew "webp"
brew "ffmpeg"
brew "fzf"
brew "git-delta"
# brew "glances"  # Use htop instead
# brew "gradle"  # No Java development
brew "gts"
brew "pango"
brew "graphviz"
brew "htop"
brew "hyperfine"
brew "ipython"
brew "lazydocker"
brew "lazygit"
brew "libheif"
brew "libmagic"
brew "libssh"
# brew "liquidprompt"  # Use powerlevel10k instead
brew "ruby"
# brew "macvim"
# brew "memcached", restart_service: true
# brew "mysql-client"
brew "ncdu"
brew "neovim"
# brew "nghttp2"
brew "nmap"
# brew "openconnect"
# brew "postgresql"
# brew "postgresql@11"
# brew "procs"  # Use standard ps/htop
brew "pyenv"
brew "ripgrep"
brew "sd"
# brew "sl"  # Novelty command, rarely used
brew "tealdeer"
# brew "telnet"
brew "tig"
brew "tmux"  # Used extensively
# brew "tokei"  # Use cloc instead
brew "tree"
# brew "unrar"
# brew "watch"
# brew "watchman"  # Facebook file watcher, not used
brew "wget"
# brew "wireshark"
brew "yarn"
# brew "ydiff"  # Use git-delta instead
brew "youtube-dl"
brew "zlib"
brew "zsh-syntax-highlighting"
# brew "cjbassi/ytop/ytop"  # Use htop instead
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

# Additional tools found in usage history
brew "cloc"  # Code line counter - used frequently
brew "jq"    # JSON processor
brew "pnpm"  # Package manager

cask "cakebrew"
cask "font-hack-nerd-font"
cask "insomnia"
brew "zoxide"

# Additional GUI applications
cask "zed"      # Code editor
cask "warp"     # AI terminal
cask "hiddenbar"  # Menu bar organizer

# Additional fonts
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"

# cask "mactex-no-gui"
# cask "powershell"
# cask "wireshark"
